TexasInstruments/c2000ware-core-sdk/device_support/f2806x/examples/c28/bl_app/deprecated/usblib/device/usbdcomp.c
//###########################################################################
//
// FILE:   usbdcomp.c
//
// TITLE:  USB composite device class driver.
//
//###########################################################################
// $TI Release: F2806x C/C++ Header Files and Peripheral Examples V141 $
// $Release Date: January 19, 2015 $
// $Copyright: Copyright (C) 2011-2015 Texas Instruments Incorporated -
//             http://www.ti.com/ ALL RIGHTS RESERVED $
//###########################################################################

#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/debug.h"
#include "driverlib/interrupt.h"
#include "driverlib/sysctl.h"
#include "driverlib/usb.h"
#include "usblib/usblib.h"
#include "usblib/usb_ids.h"
#include "usblib/usbcdc.h"
#include "usblib/device/usbdevice.h"
#include "usblib/device/usbdcdc.h"
#include "usblib/device/usbdcomp.h"

//****************************************************************************
//
//! @{
//
//****************************************************************************

//****************************************************************************
//
// Device Descriptor.  This is stored in RAM to allow several fields to be
// changed at runtime based on the client's requirements.
//
//****************************************************************************
static unsigned char g_pCompDeviceDescriptor[] =
{
    18,                     // Size of this structure.
    USB_DTYPE_DEVICE,       // Type of this structure.
    USBShort(0x110),        // USB version 1.1 (if we say 2.0, hosts assume
    // high-speed - see USB 2.0 spec 9.2.6.6)
    USB_CLASS_MISC,         // USB Device Class (spec 5.1.1)
    USB_MISC_SUBCLASS_COMMON, // USB Device Sub-class (spec 5.1.1)
    USB_MISC_PROTOCOL_IAD,  // USB Device protocol (spec 5.1.1)
    64,                     // Maximum packet size for default pipe.
    USBShort(0),            // Vendor ID (filled in during USBDCompositeInit).
    USBShort(0),            // Product ID (filled in during USBDCompositeInit).
    USBShort(0x100),        // Device Version BCD.
    1,                      // Manufacturer string identifier.
    2,                      // Product string identifier.
    3,                      // Product serial number.
    1                       // Number of configurations.
};

//****************************************************************************
//
// Composite class device configuration descriptor.
//
// It is vital that the configuration descriptor bConfigurationValue field
// (byte 6) is 1 for the first configuration and increments by 1 for each
// additional configuration defined here.  This relationship is assumed in the
// device stack for simplicity even though the USB 2.0 specification imposes
// no such restriction on the bConfigurationValue values.
//
// Note that this structure is deliberately located in RAM since we need to
// be able to patch some values in it based on client requirements.
//
//****************************************************************************
static const unsigned char g_pCompConfigDescriptor[] =
{
    //
    // Configuration descriptor header.
    //
    9,                          // Size of the configuration descriptor.
    USB_DTYPE_CONFIGURATION,    // Type of this descriptor.
    USBShort(0),                // The total size of this full structure.
    0,                          // The number of interfaces in this
    // configuration, this will be filled by
    // the class as it discovers all classes
    // supported.
    1,                          // The unique value for this configuration.
    0,                          // The string identifier that describes this
    // configuration.
    USB_CONF_ATTR_BUS_PWR,      // .
    250,                        // The maximum power in 2mA increments.
};

//****************************************************************************
//
// Byte offsets used to access various fields in our index/interface/endpoint
// lookup table (tUSBDCompositeDevice.pulDeviceWorkspace).  This workspace
// contains one 4 byte entry per device. The LSB is the device index, next byte
// is the number of the first interface not within this device, next byte is the
// number of the first IN endpoint not within this device and the final byte is
// the number of the first OUT endpoint not within this device.  Using this
// simple table we can reasonably quickly cross-reference index with interface
// and endpoint numbers.
//
//****************************************************************************
#define LOOKUP_INDEX_BYTE       0
#define LOOKUP_INTERFACE_BYTE   1
#define LOOKUP_IN_END_BYTE      2
#define LOOKUP_OUT_END_BYTE     3

//****************************************************************************
//
// A marker used to indicate an invalid index into the device table.
//
//****************************************************************************
#define INVALID_DEVICE_INDEX 0xFFFFFFFF

//*****************************************************************************
//
// Macros to convert between USB controller base address and an index.  These
// are currently trivial but are included to allow for the possibility of
// supporting more than one controller in the future.
//
//*****************************************************************************
#define USB_BASE_TO_INDEX(BaseAddr) (0)
#define USB_INDEX_TO_BASE(Index)    (USB0_BASE)

//****************************************************************************
//
// Various internal handlers needed by this class.
//
//****************************************************************************
static void HandleDisconnect(void *pvInstance);
static void InterfaceChange(void *pvInstance, unsigned char ucInterfaceNum,
                            unsigned char ucAlternateSetting);
static void ConfigChangeHandler(void *pvInstance, unsigned long ulValue);
static void DataSent(void *pvInstance, unsigned long ulInfo);
static void DataReceived(void *pvInstance, unsigned long ulInfo);
static void HandleEndpoints(void *pvInstance, unsigned long ulStatus);
static void HandleRequests(void *pvInstance, tUSBRequest *pUSBRequest);
static void SuspendHandler(void *pvInstance);
static void ResumeHandler(void *pvInstance);
static void ResetHandler(void *pvInstance);
static void GetDescriptor(void *pvInstance, tUSBRequest *pUSBRequest);

//****************************************************************************
//
// Configuration Descriptor.
//
//****************************************************************************
tConfigHeader *g_pCompConfigDescriptors[1];

//****************************************************************************
//
// The FIFO configuration for USB mass storage class device.
//
//****************************************************************************
tFIFOConfig g_sUSBCompositeFIFOConfig =
{
    //
    // IN endpoints.
    //
    {
        { false, USB_EP_DEV_IN },
        { false, USB_EP_DEV_IN },
        { false, USB_EP_DEV_IN },
        { false, USB_EP_DEV_IN },
        { false, USB_EP_DEV_IN },
        { false, USB_EP_DEV_IN },
        { false, USB_EP_DEV_IN },
        { false, USB_EP_DEV_IN },
        { false, USB_EP_DEV_IN },
        { false, USB_EP_DEV_IN },
        { false, USB_EP_DEV_IN },
        { false, USB_EP_DEV_IN },
        { false, USB_EP_DEV_IN },
        { false, USB_EP_DEV_IN },
        { false, USB_EP_DEV_IN }
    },
    //
    // OUT endpoints.
    //
    {
        { false, USB_EP_DEV_OUT },
        { false, USB_EP_DEV_OUT },
        { false, USB_EP_DEV_OUT },
        { false, USB_EP_DEV_OUT },
        { false, USB_EP_DEV_OUT },
        { false, USB_EP_DEV_OUT },
        { false, USB_EP_DEV_OUT },
        { false, USB_EP_DEV_OUT },
        { false, USB_EP_DEV_OUT },
        { false, USB_EP_DEV_OUT },
        { false, USB_EP_DEV_OUT },
        { false, USB_EP_DEV_OUT },
        { false, USB_EP_DEV_OUT },
        { false, USB_EP_DEV_OUT },
        { false, USB_EP_DEV_OUT }
    },
};

//****************************************************************************
//
// The device information structure for the USB Composite device.
//
//****************************************************************************
tDeviceInfo g_sCompositeDeviceInfo =
{
    //
    // Device event handler callbacks.
    //
    {
        //
        // GetDescriptor
        //
        GetDescriptor,

        //
        // RequestHandler
        //
        HandleRequests,

        //
        // InterfaceChange
        //
        InterfaceChange,

        //
        // ConfigChange
        //
        ConfigChangeHandler,

        //
        // DataReceived
        //
        DataReceived,

        //
        // DataSentCallback
        //
        DataSent,

        //
        // ResetHandler
        //
        ResetHandler,

        //
        // SuspendHandler
        //
        SuspendHandler,

        //
        // ResumeHandler
        //
        ResumeHandler,

        //
        // DisconnectHandler
        //
        HandleDisconnect,

        //
        // EndpointHandler
        //
        HandleEndpoints
    },
    g_pCompDeviceDescriptor,
    (const tConfigHeader **)g_pCompConfigDescriptors,
    0,
    0,
    &g_sUSBCompositeFIFOConfig
};

//****************************************************************************
//
// Use the lookup table from the field pulDeviceWorkspace in the
// tUSBDCompositeDevice structure to determine which device to call given a
// particular composite device interface number.
//
// The returned value is the index into psDevice->tCompositeEntry indicating
// the device which contains this interface or INVALID_DEVICE_INDEX if no
// device contains the passed interface number.
//
//****************************************************************************
static unsigned long
InterfaceToIndex(tUSBDCompositeDevice *psDevice, unsigned long ulInterface)
{
    unsigned long ulLoop;
    unsigned char *pucLookupEntry;

    //
    // Get a pointer to the lookup table.
    //
    pucLookupEntry = (unsigned char *)psDevice->pulDeviceWorkspace;

    //
    // Check each lookup entry in turn.
    //
    for(ulLoop = 0; ulLoop < psDevice->ulNumDevices; ulLoop++)
    {
        //
        // If the desired interface number is lower than the value in the
        // current lookup table entry, we have found the desired device so
        // return its index.
        //
        if(ulInterface < __byte((int *)pucLookupEntry, LOOKUP_INTERFACE_BYTE))
        {
            return(ulLoop);
        }

        //
        // Move to the next lookup table entry.
        //
        pucLookupEntry += sizeof(unsigned long);
    }

    //
    // If we get here, an invalid interface number was passed so return a
    // marker to indicate this.
    //
    return(INVALID_DEVICE_INDEX);
}

//****************************************************************************
//
// Use the lookup table from the field pulDeviceWorkspace in the
// tUSBDCompositeDevice structure to determine which device to call given a
// particular composite device endpoint number.
//
// The returned value is the index into psDevice->tCompositeEntry indicating
// the device which contains this endpoint or INVALID_DEVICE_INDEX if no
// device contains the passed endpoint number.
//
//****************************************************************************
static unsigned long
EndpointToIndex(tUSBDCompositeDevice *psDevice, unsigned long ulEndpoint,
                tBoolean bInEndpoint)
{
    unsigned long ulLoop, ulEndpointByte;
    unsigned char *pucLookupEntry;

    //
    // Get a pointer to the lookup table.
    //
    pucLookupEntry = (unsigned char *)psDevice->pulDeviceWorkspace;

    //
    // Are we considering an IN or OUT endpoint?
    //
    ulEndpointByte = bInEndpoint ? LOOKUP_IN_END_BYTE : LOOKUP_OUT_END_BYTE;

    //
    // Check each lookup entry in turn.
    //
    for(ulLoop = 0; ulLoop < psDevice->ulNumDevices; ulLoop++)
    {
        //
        // If the desired endpoint number is lower than the value in the
        // current lookup table entry, we have found the desired device so
        // return its index.
        //
        if(ulEndpoint < (unsigned long)pucLookupEntry[ulEndpointByte])
        {
            return(ulLoop);
        }

        //
        // Move to the next lookup table entry.
        //
        pucLookupEntry += sizeof(unsigned long);
    }

    //
    // If we get here, an invalid endpoint number was passed so return a
    // marker to indicate this.
    //
    return(INVALID_DEVICE_INDEX);
}


//****************************************************************************
//
// This function will check if any device classes need a get descriptor
// handler called.
//
//****************************************************************************
static void
GetDescriptor(void *pvInstance, tUSBRequest *pUSBRequest)
{
    unsigned long ulIdx;
    const tDeviceInfo *pDeviceInfo;
    tUSBDCompositeDevice *psDevice;

    //
    // Create the device instance pointer.
    //
    psDevice = (tUSBDCompositeDevice *)pvInstance;

    //
    // Determine which device this request is intended for.  We have to be
    // careful here to send this to the callback for the correct device
    // depending upon whether it is a request sent to the device, the interface
    // or the endpoint.
    //
    switch(pUSBRequest->bmRequestType & USB_RTYPE_RECIPIENT_M)
    {
    case USB_RTYPE_INTERFACE:
    {
        ulIdx = InterfaceToIndex(psDevice, (readShort(&(pUSBRequest->wIndex)) & 0xFF));
        break;
    }

    case USB_RTYPE_ENDPOINT:
    {
        ulIdx = EndpointToIndex(psDevice, (readShort(&(pUSBRequest->wIndex)) & 0x0F),
                                (readShort(&(pUSBRequest->wIndex)) & 0x80) ? true : false);
        break;
    }

    //
    // Requests sent to the device or any other recipient can't be
    // handled here since we have no way of telling where they are
    // supposed to be handled.  As a result, we just stall them.
    //
    // If your composite device has some device-specific descriptors,
    // you should add code here to handle them.
    //
    case USB_RTYPE_DEVICE:
    case USB_RTYPE_OTHER:
    default:
    {
        ulIdx = INVALID_DEVICE_INDEX;
        break;
    }
    }

    //
    // Did we find a device class to pass the request to?
    //
    if(ulIdx != INVALID_DEVICE_INDEX)
    {
        //
        // Get a pointer to the individual device instance.
        //
        pDeviceInfo = psDevice->psDevices[ulIdx].psDevice;

        //
        // Does this device have a GetDescriptor callback?
        //
        if(pDeviceInfo->sCallbacks.pfnGetDescriptor)
        {
            //
            // Remember this device index so that we can correctly route any
            // data notification callbacks to it.
            //
            psDevice->psPrivateData->ulEP0Owner = ulIdx;

            //
            // Call the device to retrieve the descriptor.
            //
            pDeviceInfo->sCallbacks.pfnGetDescriptor(
                psDevice->psDevices[ulIdx].pvInstance, pUSBRequest);
        }
        else
        {
            //
            // Oops - we can't satisfy the request so stall EP0 to indicate
            // an error.
            //
            USBDCDStallEP0(
                USB_BASE_TO_INDEX(psDevice->psPrivateData->ulUSBBase));
        }
    }
    else
    {
        //
        // We are unable to satisfy the descriptor request so stall EP0 to
        // indicate an error.
        //
        USBDCDStallEP0(USB_BASE_TO_INDEX(psDevice->psPrivateData->ulUSBBase));
    }
}

//****************************************************************************
//
// This function will check if any device classes need an suspend handler
// called.
//
//****************************************************************************
static void
SuspendHandler(void *pvInstance)
{
    unsigned long ulIdx;
    tUSBDCompositeDevice *psDevice;
    const tDeviceInfo *pDeviceInfo;
    void *pvDeviceInst;

    ASSERT(pvInstance != 0);

    //
    // Create the device instance pointer.
    //
    psDevice = (tUSBDCompositeDevice *)pvInstance;

    //
    // Inform the application that the device has resumed.
    //
    if(psDevice->pfnCallback)
    {
        psDevice->pfnCallback(pvInstance, USB_EVENT_SUSPEND, 0, 0);
    }

    for(ulIdx = 0; ulIdx < psDevice->ulNumDevices; ulIdx++)
    {
        pDeviceInfo = psDevice->psDevices[ulIdx].psDevice;
        pvDeviceInst = psDevice->psDevices[ulIdx].pvInstance;

        if(pDeviceInfo->sCallbacks.pfnSuspendHandler)
        {
            pDeviceInfo->sCallbacks.pfnSuspendHandler(pvDeviceInst);
        }
    }
}

//****************************************************************************
//
// This function will check if any device classes need an resume handler
// called.
//
//****************************************************************************
static void
ResumeHandler(void *pvInstance)
{
    unsigned long ulIdx;
    tUSBDCompositeDevice *psDevice;
    const tDeviceInfo *pDeviceInfo;
    void *pvDeviceInst;

    ASSERT(pvInstance != 0);

    //
    // Create the device instance pointer.
    //
    psDevice = (tUSBDCompositeDevice *)pvInstance;

    //
    // Inform the application that the device has resumed.
    //
    if(psDevice->pfnCallback)
    {
        psDevice->pfnCallback(pvInstance, USB_EVENT_RESUME, 0, 0);
    }

    for(ulIdx = 0; ulIdx < psDevice->ulNumDevices; ulIdx++)
    {
        pDeviceInfo = psDevice->psDevices[ulIdx].psDevice;
        pvDeviceInst = psDevice->psDevices[ulIdx].pvInstance;

        if(pDeviceInfo->sCallbacks.pfnResumeHandler)
        {
            pDeviceInfo->sCallbacks.pfnResumeHandler(pvDeviceInst);
        }
    }
}

//****************************************************************************
//
// This function will check if any device classes need an reset handler
// called.
//
//****************************************************************************
static void
ResetHandler(void *pvInstance)
{
    unsigned long ulIdx;
    tUSBDCompositeDevice *psDevice;
    const tDeviceInfo *pDeviceInfo;
    void *pvDeviceInst;

    ASSERT(pvInstance != 0);

    //
    // Create the device instance pointer.
    //
    psDevice = (tUSBDCompositeDevice *)pvInstance;

    //
    // Inform the application that the device has been connected.
    //
    if(psDevice->pfnCallback)
    {
        psDevice->pfnCallback(pvInstance, USB_EVENT_CONNECTED, 0, 0);
    }

    for(ulIdx = 0; ulIdx < psDevice->ulNumDevices; ulIdx++)
    {
        pDeviceInfo = psDevice->psDevices[ulIdx].psDevice;
        pvDeviceInst = psDevice->psDevices[ulIdx].pvInstance;

