TexasInstruments/c2000ware-core-sdk/device_support/f2806x/examples/c28/bl_app/deprecated/usblib/device/usbdcomp.c
        if(pDeviceInfo->sCallbacks.pfnResetHandler)
        {
            pDeviceInfo->sCallbacks.pfnResetHandler(pvDeviceInst);
        }
    }
}

//****************************************************************************
//
// This function is called to handle data being set to the host so that the
// application callback can be called when the data has been transferred.
//
//****************************************************************************
static void
DataSent(void *pvInstance, unsigned long ulInfo)
{
    unsigned long ulIdx;
    const tDeviceInfo *pDeviceInfo;
    tUSBDCompositeDevice *psDevice;

    //
    // Create the device instance pointer.
    //
    psDevice = (tUSBDCompositeDevice *)pvInstance;

    //
    // Pass this notification on to the device which last handled a
    // transaction on endpoint 0 (assuming we know who that was).
    //
    ulIdx = psDevice->psPrivateData->ulEP0Owner;

    if(ulIdx != INVALID_DEVICE_INDEX)
    {
        pDeviceInfo = psDevice->psDevices[ulIdx].psDevice;

        if(pDeviceInfo->sCallbacks.pfnDataSent)
        {
            pDeviceInfo->sCallbacks.pfnDataSent(
                psDevice->psDevices[ulIdx].pvInstance, ulInfo);
        }
    }
}

//****************************************************************************
//
// This function is called to handle data being received back from the host so
// that the application callback can be called when the new data is ready.
//
//****************************************************************************
static void
DataReceived(void *pvInstance, unsigned long ulInfo)
{
    unsigned long ulIdx;
    const tDeviceInfo *pDeviceInfo;
    tUSBDCompositeDevice *psDevice;

    //
    // Create the device instance pointer.
    //
    psDevice = (tUSBDCompositeDevice *)pvInstance;

    //
    // Pass this notification on to the device which last handled a
    // transaction on endpoint 0 (assuming we know who that was).
    //
    ulIdx = psDevice->psPrivateData->ulEP0Owner;

    if(ulIdx != INVALID_DEVICE_INDEX)
    {
        pDeviceInfo = psDevice->psDevices[ulIdx].psDevice;

        if(pDeviceInfo->sCallbacks.pfnDataReceived)
        {
            pDeviceInfo->sCallbacks.pfnDataReceived(
                psDevice->psDevices[ulIdx].pvInstance, ulInfo);
        }
    }
}

//****************************************************************************
//
// This function will check if any device classes need an endpoint handler
// called.
//
//****************************************************************************
static void
HandleEndpoints(void *pvInstance, unsigned long ulStatus)
{
    unsigned long ulIdx;
    const tDeviceInfo *pDeviceInfo;
    tUSBDCompositeDevice *psDevice;

    ASSERT(pvInstance != 0);

    //
    // Create the device instance pointer.
    //
    psDevice = (tUSBDCompositeDevice *)pvInstance;

    //
    // Call each of the endpoint handlers.  This may seem odd since we should
    // only call the handler whose endpoint needs service.  Unfortunately, if
    // the device class driver is using uDMA, we have no way of knowing which
    // handler to call (since ulStatus will be 0).  Since the handlers are
    // set up to ignore any callback that isn't for them, this is safe.
    //
    for(ulIdx = 0; ulIdx < psDevice->ulNumDevices; ulIdx++)
    {
        pDeviceInfo = psDevice->psDevices[ulIdx].psDevice;

        if(pDeviceInfo->sCallbacks.pfnEndpointHandler)
        {
            pDeviceInfo->sCallbacks.pfnEndpointHandler(
                psDevice->psDevices[ulIdx].pvInstance, ulStatus);
        }
    }
}

//****************************************************************************
//
// This function is called by the USB device stack whenever the device is
// disconnected from the host.
//
//****************************************************************************
static void
HandleDisconnect(void *pvInstance)
{
    unsigned long ulIdx;
    const tDeviceInfo *pDeviceInfo;
    tUSBDCompositeDevice *psDevice;

    ASSERT(pvInstance != 0);

    //
    // Create the device instance pointer.
    //
    psDevice = (tUSBDCompositeDevice *)pvInstance;

    //
    // Inform the application that the device has been disconnected.
    //
    if(psDevice->pfnCallback)
    {
        psDevice->pfnCallback(pvInstance, USB_EVENT_DISCONNECTED, 0, 0);
    }

    for(ulIdx = 0; ulIdx < psDevice->ulNumDevices; ulIdx++)
    {
        pDeviceInfo = psDevice->psDevices[ulIdx].psDevice;

        if(pDeviceInfo->sCallbacks.pfnDisconnectHandler)
        {
            pDeviceInfo->sCallbacks.pfnDisconnectHandler(
                psDevice->psDevices[ulIdx].pvInstance);
        }
    }
}

//****************************************************************************
//
// This function is called by the USB device stack whenever the device
// interface changes.  It will be passed on to the device classes if they have
// a handler for this function.
//
//****************************************************************************
static void
InterfaceChange(void *pvInstance, unsigned char ucInterfaceNum,
                unsigned char ucAlternateSetting)
{
    unsigned long ulIdx;
    const tDeviceInfo *pDeviceInfo;
    tUSBDCompositeDevice *psDevice;

    ASSERT(pvInstance != 0);

    //
    // Create the device instance pointer.
    //
    psDevice = (tUSBDCompositeDevice *)pvInstance;

    for(ulIdx = 0; ulIdx < psDevice->ulNumDevices; ulIdx++)
    {
        pDeviceInfo = psDevice->psDevices[ulIdx].psDevice;

        if(pDeviceInfo->sCallbacks.pfnInterfaceChange)
        {
            pDeviceInfo->sCallbacks.pfnInterfaceChange(
                psDevice->psDevices[ulIdx].pvInstance, ucInterfaceNum,
                ucAlternateSetting);
        }
    }
}

//****************************************************************************
//
// This function is called by the USB device stack whenever the device
// configuration changes. It will be passed on to the device classes if they
// have a handler for this function.
//
//****************************************************************************
static void
ConfigChangeHandler(void *pvInstance, unsigned long ulValue)
{
    unsigned long ulIdx;
    const tDeviceInfo *pDeviceInfo;
    tUSBDCompositeDevice *psDevice;

    ASSERT(pvInstance != 0);

    //
    // Create the device instance pointer.
    //
    psDevice = (tUSBDCompositeDevice *)pvInstance;

    for(ulIdx = 0; ulIdx < psDevice->ulNumDevices; ulIdx++)
    {
        pDeviceInfo = psDevice->psDevices[ulIdx].psDevice;

        if(pDeviceInfo->sCallbacks.pfnConfigChange)
        {
            pDeviceInfo->sCallbacks.pfnConfigChange(
                psDevice->psDevices[ulIdx].pvInstance, ulValue);
        }
    }
}

//****************************************************************************
//
// This function is called by the USB device stack whenever a non-standard
// request is received.
//
// \param pvInstance
// \param pUSBRequest points to the request received.
//
// This call  will be passed on to the device classes if they have a handler
// for this function.
//
// \return None.
//
//****************************************************************************
static void
HandleRequests(void *pvInstance, tUSBRequest *pUSBRequest)
{
    unsigned long ulIdx;
    const tDeviceInfo *pDeviceInfo;
    tUSBDCompositeDevice *psDevice;

    //
    // Create the device instance pointer.
    //
    psDevice = (tUSBDCompositeDevice *)pvInstance;

    //
    // Determine which device this request is intended for.  We have to be
    // careful here to send this to the callback for the correct device
    // depending upon whether it is a request sent to the device, the interface
    // or the endpoint.
    //
    switch(pUSBRequest->bmRequestType & USB_RTYPE_RECIPIENT_M)
    {
    case USB_RTYPE_INTERFACE:
    {
        ulIdx = InterfaceToIndex(psDevice, (readShort(&(pUSBRequest->wIndex)) & 0xFF));
        break;
    }

    case USB_RTYPE_ENDPOINT:
    {
        ulIdx = EndpointToIndex(psDevice, (readShort(&(pUSBRequest->wIndex)) & 0x0F),
                                (readShort(&(pUSBRequest->wIndex)) & 0x80) ? true : false);
        break;
    }

    //
    // Requests sent to the device or any other recipient can't be
    // handled here since we have no way of telling where they are
    // supposed to be handled.  As a result, we just stall them.
    //
    // If your composite device has some device-specific requests that need
    // to be handled at the device (rather than interface or endpoint)
    // level, you should add code here to handle them.
    //
    case USB_RTYPE_DEVICE:
    case USB_RTYPE_OTHER:
    default:
    {
        ulIdx = INVALID_DEVICE_INDEX;
        break;
    }
    }

    //
    // Did we find a device class to pass the request to?
    //
    if(ulIdx != INVALID_DEVICE_INDEX)
    {
        //
        // Get a pointer to the individual device instance.
        //
        pDeviceInfo = psDevice->psDevices[ulIdx].psDevice;

        //
        // Does this device have a RequestHandler callback?
        //
        if(pDeviceInfo->sCallbacks.pfnRequestHandler)
        {
            //
            // Remember this device index so that we can correctly route any
            // data notification callbacks to it.
            //
            psDevice->psPrivateData->ulEP0Owner = ulIdx;

            //
            // Yes - call the device to retrieve the descriptor.
            //
            pDeviceInfo->sCallbacks.pfnRequestHandler(
                psDevice->psDevices[ulIdx].pvInstance, pUSBRequest);
        }
        else
        {
            //
            // Oops - we can't satisfy the request so stall EP0 to indicate
            // an error.
            //
            USBDCDStallEP0(
                USB_BASE_TO_INDEX(psDevice->psPrivateData->ulUSBBase));
        }
    }
    else
    {
        //
        // We are unable to satisfy the descriptor request so stall EP0 to
        // indicate an error.
        //
        USBDCDStallEP0(USB_BASE_TO_INDEX(psDevice->psPrivateData->ulUSBBase));
    }

