TexasInstruments/c2000ware-core-sdk/device_support/f2806x/examples/c28/bl_app/deprecated/usblib/device/usbdcomp.c
}

//****************************************************************************
//
// This function handles sending interface number changes to device instances.
//
//****************************************************************************
static void
CompositeIfaceChange(tCompositeEntry *pCompDevice, unsigned char ucOld,
                     unsigned char ucNew)
{
    unsigned char pucInterfaces[2];

    if(pCompDevice->psDevice->sCallbacks.pfnDeviceHandler)
    {
        //
        // Create the data to pass to the device handler.
        //
        pucInterfaces[0] = ucOld;
        pucInterfaces[1] = ucNew;

        //
        // Call the device handler to inform the class of the interface number
        // change.
        //
        pCompDevice->psDevice->sCallbacks.pfnDeviceHandler(
            pCompDevice->pvInstance, USB_EVENT_COMP_IFACE_CHANGE,
            (void *)pucInterfaces);
    }
}

//****************************************************************************
//
// This function handles sending endpoint number changes to device instances.
//
//****************************************************************************
static void
CompositeEPChange(tCompositeEntry *pCompDevice, unsigned char ucOld,
                  unsigned char ucNew)
{
    unsigned char pucInterfaces[2];
    unsigned char ucIndex;

    if(pCompDevice->psDevice->sCallbacks.pfnDeviceHandler)
    {
        //
        // Create the data to pass to the device handler.
        //
        pucInterfaces[0] = ucOld;
        pucInterfaces[1] = ucNew;

        ucNew--;

        if(ucOld & USB_RTYPE_DIR_IN)
        {
            ucIndex = (ucOld & ~USB_RTYPE_DIR_IN) - 1;

            g_sUSBCompositeFIFOConfig.sIn[ucNew].bDoubleBuffer =
                pCompDevice->psDevice->psFIFOConfig->sIn[ucIndex].bDoubleBuffer;

            g_sUSBCompositeFIFOConfig.sIn[ucNew].usEPFlags =
                pCompDevice->psDevice->psFIFOConfig->sIn[ucIndex].usEPFlags;
        }
        else
        {
            ucIndex = ucOld - 1;

            g_sUSBCompositeFIFOConfig.sOut[ucNew].bDoubleBuffer =
                pCompDevice->psDevice->psFIFOConfig->sOut[ucIndex].bDoubleBuffer;

            g_sUSBCompositeFIFOConfig.sOut[ucNew].usEPFlags =
                pCompDevice->psDevice->psFIFOConfig->sOut[ucIndex].usEPFlags;
        }
        //
        // Call the device handler to inform the class of the interface number
        // change.
        //
        pCompDevice->psDevice->sCallbacks.pfnDeviceHandler(
            pCompDevice->pvInstance, USB_EVENT_COMP_EP_CHANGE,
            (void *)pucInterfaces);
    }
}

//****************************************************************************
//
// This function merges the configuration descriptors into a single multiple
// instance device.
//
//****************************************************************************
unsigned long
BuildCompositeDescriptor(tUSBDCompositeDevice *psCompDevice)
{
    unsigned long ulIdx, ulOffset, ulCPIdx, ulFixINT, ulDev;
    unsigned short usTotalLength, usBytes;
    unsigned char ucInterface, ucINEndpoint, ucOUTEndpoint;
    unsigned char *pucData, *pucConfig;
    const tConfigHeader *pConfigHeader;
    tDescriptorHeader *psHeader;
    const unsigned char *pucDescriptor;
    tInterfaceDescriptor *psInterface;
    tEndpointDescriptor *psEndpoint;
    const tDeviceInfo *psDevice;

    //
    // Save the number of devices to look through.
    //
    ulDev = 0;
    ulIdx = 0;
    ucInterface = 0;
    ucINEndpoint = 1;
    ucOUTEndpoint = 1;
    ulOffset = 0;
    ulFixINT = 0;

    //
    // This puts the first section pointer in the first entry in the list
    // of sections.
    //
    psCompDevice->psPrivateData->ppsCompSections[0] =
        &psCompDevice->psPrivateData->psCompSections[0];

    //
    // Put the pointer to this instances configuration descriptor into the
    // front of the list.
    //
    psCompDevice->psPrivateData->ppsCompSections[0]->pucData =
        (unsigned char *)&psCompDevice->psPrivateData->sConfigDescriptor;

    writeShort(&(psCompDevice->psPrivateData->ppsCompSections[0]->usSize),
        psCompDevice->psPrivateData->sConfigDescriptor.bLength);

    //
    // The configuration descriptor is 9 bytes so initialize the total length
    // to 9 bytes.
    //
    usTotalLength = 9;

    //
    // Copy the section pointer into the section array for the composite
    // device.  This is awkward but is required given the definition
    // of the structures.
    //
    psCompDevice->psPrivateData->ppsCompSections[1] =
        &psCompDevice->psPrivateData->psCompSections[1];

    //
    // Copy the pointer to the application supplied space into the section
    // list.
    //
    writeShort(&(psCompDevice->psPrivateData->ppsCompSections[1]->usSize), 0);
    psCompDevice->psPrivateData->ppsCompSections[1]->pucData =
        psCompDevice->psPrivateData->pucData;

    //
    // Create a local pointer to the data that is used to copy data from
    // the other devices into the composite descriptor.
    //
    pucData = psCompDevice->psPrivateData->pucData;

    //
    // Consider each device in turn.
    //
    while(ulDev < psCompDevice->ulNumDevices)
    {
        //
        // Save the current starting address of this descriptor.
        //
        pucConfig = pucData + ulOffset;

        //
        // Create a local pointer to the configuration header.
        //
        psDevice = psCompDevice->psDevices[ulDev].psDevice;
        pConfigHeader = psDevice->ppConfigDescriptors[0];

        //
        // Loop through each of the sections in this device's configuration
        // descriptor.
        //
        for(ulIdx = 0; ulIdx < pConfigHeader->ucNumSections; ulIdx++)
        {
            //
            // Initialize the local offset in this descriptor.  We include
            // a special case here to ignore the initial 9 byte config
            // descriptor since this has already been handled.
            //
            if(ulIdx)
            {
                //
                // This is not the first section so we handle everything in
                // it.
                //
                usBytes = 0;
            }
            else
            {
                //
                // This is the first section for this device so skip the 9
                // byte config descriptor since we've already handled this.
                //
                usBytes = 9;

                //
                // If this section includes only the config descriptor, skip
                // it entirely.
                //
                if(readShort(&(pConfigHeader->psSections[ulIdx]->usSize)) <= usBytes)
                {
                    continue;
                }
            }

            //
            // Get a pointer to the configuration descriptor.
            //
            pucDescriptor = pConfigHeader->psSections[ulIdx]->pucData;

            //
            // Bounds check the allocated space and return if there is not
            // enough space.
            //
            if(ulOffset > psCompDevice->psPrivateData->ulDataSize)
            {
                return(1);
            }

            //
            // Copy the descriptor from the device into the descriptor list.
            //
            for(ulCPIdx = 0;
                    ulCPIdx < readShort(&(pConfigHeader->psSections[ulIdx]->usSize));
                    ulCPIdx++)
            {
                pucData[ulCPIdx + ulOffset] = pucDescriptor[ulCPIdx];
            }

            //
            // Read out the descriptors in this section.
            //
            while(usBytes < readShort(&(pConfigHeader->psSections[ulIdx]->usSize)))
            {
                //
                // Create a descriptor header pointer.
                //
                psHeader = (tDescriptorHeader *)&pucData[ulOffset + usBytes];

                //
                // Check for interface descriptors and modify the numbering to
                // match the composite device.
                //
                if(psHeader->bDescriptorType == USB_DTYPE_INTERFACE)
                {
                    psInterface = (tInterfaceDescriptor *)psHeader;

                    //
                    // See if this is an alternate setting or the initial
                    // setting.
                    //
                    if(psInterface->bAlternateSetting != 0)
                    {
                        //
                        // If this is an alternate setting then use the
                        // previous interface number because the current one
                        // has already been incremented.
                        //
                        psInterface->bInterfaceNumber = ucInterface - 1;
                    }
                    else
                    {
                        //
                        // Notify the class that it's interface number has
                        // changed.
                        //
                        CompositeIfaceChange(&psCompDevice->psDevices[ulDev],
                                             psInterface->bInterfaceNumber,
                                             ucInterface);
                        //
                        // This was the non-alternate setting so save the
                        // value and move to the next interface number.
                        //
                        psInterface->bInterfaceNumber = ucInterface;

                        //
                        // No strings allowed on interface descriptors for
                        // composite devices.
                        //
                        psInterface->iInterface = 0;

