TexasInstruments/c2000ware-core-sdk/device_support/f2806x/examples/c28/bl_app/deprecated/usblib/device/usbdcomp.c
                        ucInterface++;
                    }
                }
                //
                // Check for endpoint descriptors and modify the numbering to
                // match the composite device.
                //
                else if(psHeader->bDescriptorType == USB_DTYPE_ENDPOINT)
                {
                    psEndpoint = (tEndpointDescriptor *)psHeader;

                    //
                    // Check if this is an IN or OUT endpoint.
                    //
                    if(psEndpoint->bEndpointAddress & USB_RTYPE_DIR_IN)
                    {
                        //
                        // Check if this is the special Fixed Interrupt class
                        // and this is the interrupt endpoint.
                        //
                        if(((psEndpoint->bmAttributes & USB_EP_ATTR_TYPE_M) ==
                                USB_EP_ATTR_INT) &&
                                (psCompDevice->usPID == USB_PID_COMP_SERIAL))
                        {
                            //
                            // Check if the Fixed Interrupt endpoint has been
                            // set yet.
                            //
                            if(ulFixINT == 0)
                            {
                                //
                                // Allocate the fixed interrupt endpoint and
                                // save its number.
                                //
                                ulFixINT = ucINEndpoint++;
                            }

                            CompositeEPChange(&psCompDevice->psDevices[ulDev],
                                              psEndpoint->bEndpointAddress,
                                              ulFixINT);

                            psEndpoint->bEndpointAddress = ulFixINT |
                                                           USB_RTYPE_DIR_IN;
                        }
                        else
                        {
                            //
                            // Notify the class that it's interface number has
                            // changed.
                            //
                            CompositeEPChange(&psCompDevice->psDevices[ulDev],
                                              psEndpoint->bEndpointAddress,
                                              ucINEndpoint);

                            psEndpoint->bEndpointAddress = ucINEndpoint++ |
                                                           USB_RTYPE_DIR_IN;
                        }
                    }
                    else
                    {
                        //
                        // Notify the class that it's interface number has
                        // changed.
                        //
                        CompositeEPChange(&psCompDevice->psDevices[ulDev],
                                          psEndpoint->bEndpointAddress,
                                          ucOUTEndpoint);
                        psEndpoint->bEndpointAddress = ucOUTEndpoint++;
                    }
                }

                //
                // Move on to the next descriptor.
                //
                usBytes += psHeader->bLength;
            }

            ulOffset += readShort(&(pConfigHeader->psSections[ulIdx]->usSize));

            usTotalLength += usBytes;
        }

        //
        // Allow the device class to make adjustments to the configuration
        // descriptor.
        //
        psCompDevice->psDevices[ulDev].psDevice->sCallbacks.pfnDeviceHandler(
            psCompDevice->psDevices[ulDev].pvInstance,
            USB_EVENT_COMP_CONFIG, (void *)pucConfig);

        //
        // Add an entry into the device workspace array to allow us to quickly
        // map interface and endpoint numbers to device instances later.
        //
        psCompDevice->pulDeviceWorkspace[ulDev] =
            (ulDev << (LOOKUP_INDEX_BYTE * 8)) |
            (ucInterface << (LOOKUP_INTERFACE_BYTE * 8)) |
            ((unsigned long)ucOUTEndpoint << (LOOKUP_OUT_END_BYTE * 8)) |
            ((unsigned long)ucINEndpoint << (LOOKUP_IN_END_BYTE * 8));

        //
        // Move on to the next device.
        //
        ulDev++;
    }

    //
    // Modify the configuration descriptor to match the number of interfaces
    // and the new total size.
    //
    psCompDevice->psPrivateData->sCompConfigHeader.ucNumSections = 2;
    writeShort(&(psCompDevice->psPrivateData->ppsCompSections[1]->usSize), ulOffset);
    psCompDevice->psPrivateData->sConfigDescriptor.bNumInterfaces =
        ucInterface;
    writeShort(&(psCompDevice->psPrivateData->sConfigDescriptor.wTotalLength), usTotalLength);


    return(0);
}

//****************************************************************************
//
//! This function should be called once for the composite class device to
//! initialize basic operation and prepare for enumeration.
//!
//! \param ulIndex is the index of the USB controller to initialize for
//! composite device operation.
//! \param psDevice points to a structure containing parameters customizing
//! the operation of the composite device.
//! \param ulSize is the size in bytes of the data pointed to by the
//! \e pucData parameter.
//! \param pucData is the data area that the composite class can use to build
//! up descriptors.
//!
//! In order for an application to initialize the USB composite device class,
//! it must first call this function with the a valid composite device class
//! structure in the \e psDevice parameter.  This allows this function to
//! initialize the USB controller and device code to be prepared to enumerate
//! and function as a USB composite device.  The \e ulSize and \e pucData
//! parameters should be large enough to hold all of the class instances
//! passed in via the psDevice structure.  This is typically the full size of
//! the configuration descriptor for a device minus its configuration
//! header(9 bytes).
//!
//! This function returns a void pointer that must be passed in to all other
//! APIs used by the composite class.
//!
//! See the documentation on the tUSBDCompositeDevice structure for more
//! information on how to properly fill the structure members.
//!
//! \return This function returns 0 on failure or a non-zero void pointer on
//! success.
//
//****************************************************************************
void *
USBDCompositeInit(unsigned long ulIndex, tUSBDCompositeDevice *psDevice,
                  unsigned long ulSize, unsigned char *pucData)
{
    tCompositeInstance *psInst;
    long lIdx;
    unsigned char *pucTemp;

    //
    // Check parameter validity.
    //
    ASSERT(ulIndex == 0);
    ASSERT(psDevice);
    ASSERT(psDevice->ppStringDescriptors);
    ASSERT(psDevice->psPrivateData);

    //
    // Initialize the work space in the passed instance structure.
    //
    psInst = psDevice->psPrivateData;
    psInst->ulDataSize = ulSize;
    psInst->pucData = pucData;

    //
    // Save the base address of the USB controller.
    //
    psInst->ulUSBBase = USB_INDEX_TO_BASE(ulIndex);

    //
    // No device is currently transfering data on EP0.
    //
    psInst->ulEP0Owner = INVALID_DEVICE_INDEX;

    //
    // Set the device information for the composite device.
    //
    psInst->psDevInfo = &g_sCompositeDeviceInfo;

